In [316]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [317]:
df = pd.read_csv(r'train.csv')

In [318]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [319]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [320]:
df_train = df.drop(['Name','Ticket','Cabin'],axis=1)

In [321]:
df_train

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,male,22.0,1,0,7.2500,S
1,2,1,1,female,38.0,1,0,71.2833,C
2,3,1,3,female,26.0,0,0,7.9250,S
3,4,1,1,female,35.0,1,0,53.1000,S
4,5,0,3,male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,13.0000,S
887,888,1,1,female,19.0,0,0,30.0000,S
888,889,0,3,female,NaN,1,2,23.4500,S
889,890,1,1,male,26.0,0,0,30.0000,C
890,891,0,3,male,32.0,0,0,7.7500,Q

In [322]:
from sklearn.preprocessing import LabelEncoder
model1 = LabelEncoder()
df_train['Sex'] = pd.DataFrame(model1.fit_transform(df_train['Sex']))

In [323]:
df_train['Embarked'] = pd.DataFrame(model1.fit_transform(df_train['Embarked']))

In [324]:
df_train['Age'].fillna(24,inplace=True)

In [325]:
df_train['Fare'] = df_train['Fare'].astype('int64')
df_train['Age'] = df_train['Age'].astype('int64')

In [326]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [327]:
X = df_train.drop('Survived',axis=1)
y = df_train['Survived']

In [328]:
from sklearn.ensemble import rand
Dtc = DecisionTreeClassifier()
Dtc.fit(X,y)

DecisionTreeClassifier()

In [329]:
y_test = pd.read_csv('test.csv')

In [330]:
y_test['Age'].mode()

0    21.0
1    24.0
Name: Age, dtype: float64

In [331]:
y_test['Age'].fillna(24,inplace=True)

In [332]:

y_test['Sex'] = pd.DataFrame(model1.fit_transform(y_test['Sex']))
y_test['Embarked'] = pd.DataFrame(model1.fit_transform(y_test['Embarked']))

In [333]:
y_test1 = y_test.drop(['Name','Ticket','Cabin'],axis=1)

In [334]:
y_test1

     PassengerId  Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0            892       3    1  34.5      0      0    7.8292         1
1            893       3    0  47.0      1      0    7.0000         2
2            894       2    1  62.0      0      0    9.6875         1
3            895       3    1  27.0      0      0    8.6625         2
4            896       3    0  22.0      1      1   12.2875         2
..           ...     ...  ...   ...    ...    ...       ...       ...
413         1305       3    1  24.0      0      0    8.0500         2
414         1306       1    0  39.0      0      0  108.9000         0
415         1307       3    1  38.5      0      0    7.2500         2
416         1308       3    1  24.0      0      0    8.0500         2
417         1309       3    1  24.0      1      1   22.3583         0

[418 rows x 8 columns]

In [335]:
y_test1['Fare'].mode()

0    7.75
Name: Fare, dtype: float64

In [336]:
y_test1['Fare'] = y_test1['Fare'].fillna(7.75)

In [337]:
y_test1['Fare'] = y_test1['Fare'].astype('int64')
y_test1['Age'] = y_test1['Age'].astype('int64')

In [338]:
y_test1

     PassengerId  Pclass  Sex  Age  SibSp  Parch  Fare  Embarked
0            892       3    1   34      0      0     7         1
1            893       3    0   47      1      0     7         2
2            894       2    1   62      0      0     9         1
3            895       3    1   27      0      0     8         2
4            896       3    0   22      1      1    12         2
..           ...     ...  ...  ...    ...    ...   ...       ...
413         1305       3    1   24      0      0     8         2
414         1306       1    0   39      0      0   108         0
415         1307       3    1   38      0      0     7         2
416         1308       3    1   24      0      0     8         2
417         1309       3    1   24      1      1    22         0

[418 rows x 8 columns]

In [339]:
prediction = Dtc.predict(y_test1)

In [340]:
y_test1.index

RangeIndex(start=0, stop=418, step=1)

In [341]:
y_test.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [342]:
output = pd.DataFrame({'PassengerId':y_test.PassengerId,'Survived':prediction})

In [343]:
output.to_csv('submission.csv',index=False)